package com.xulu.review.design;

/**
 * 设计模式
 *
 * @author xulu  E-mail:java_xul@163.com
 * @version 1.0
 * @create 2019-07-21 21:29
 **/
public class DesignPatternDemo {


    /**
     * 1。设计模式的7大原则是什么？
     * 1）单一职责原则
     * 2）接口隔离原则
     * 3）依赖倒转原则
     * 4）里氏替换原则
     * 5）开闭原则ocp
     * 6）迪米特法则
     * 7）合成复用原则
     */


    /**
     * 面试题1：
     *   1）介绍解释器设计模式是什么？
     *
     *   2）画出解释器设计模式的uml类图，分析设计模式的各个角色是什么？
     *
     *   3）请说明spring的框架中，哪里使用到了解释器设计模式，并做源码级别的分析？
     */

    /**
     * 面试题2：
     *   1）单利设计模式一共有几种实现方式？请分别用代码实现，并说明各个实现方式的有点和缺点？
     */
}
